{
  "articles": [
    {
      "title": "Happiness ",
      "content": "This chapter of my day, is called happiness. Nothing beats the feeling of solving a bug that has been eating you up. Oh! The adrenaline Rush!!!",
      "id": 4
    },
    {
      "title": "Rest time",
      "content": "Just finished with all the basic functionalities of my web application and now I can cook and rest. A sigh of relief.",
      "id": 5
    },
    {
      "title": "Another Article",
      "content": "This is another article after updating my UI",
      "id": 6
    },
    {
      "title": "Journey",
      "content": "The first time I ever touched a piece of code was in my third year Computer Science unit during my undergraduate Bachelor of Science in Civil Engineering degree. I remember being intrigued by how the things we were doing were possible but I never really understood the full capabilities of computer programming. It was until I met a friend of mine called Cedric Muuo, a software engineer who specializes in Quality Analysis that I really understood what this whole computer programming thing is and it's full capabilities. Of course the first thing that captured my attention was his lifestyle and how much money he was making. Seeing how much he was making, I got interested immediately of course because I also wanted to make as much money as he was haha. So my journey in tech began. I started learning by myself through YouTube tutorials. As I continued learning, I started enjoying it and I slowly realized that this is what I wanted to do. What started as something that I got into because of the money in the industry slowly started turning into passion and every morning I was looking forward to opening my laptop. In the middle of my journey, I met a friend who was in Moringa and after he told me everything about Moringa I did not even think twice. I immediately applied and luckily I got accepted and even received a partial scholarship. \n\nMy journey in Moringa so far has been ok. I can't say it has been smooth as there have been moments that I was frustrated and even contemplated dropping out. But now we are at the end of the second phase and I am still going strong. The warrior in me is still being developed and my dream to be the best software engineer the world has ever seen is still alive. I am definitely excited for what this journey has in store for me.\n\nRegards,\nKijana Wa Alliance.",
      "id": 7
    }
  ]
}